{"id":2273,"date":"2021-07-19T16:43:02","date_gmt":"2021-07-19T16:43:02","guid":{"rendered":"http:\/\/demos.casethemes.net\/troma\/2018\/10\/22\/photo-booth-anim-8-bit-pbr-3-wolf-moon-copy\/"},"modified":"2021-12-18T20:14:40","modified_gmt":"2021-12-18T20:14:40","slug":"10-questions-you-should-ask-a-web-designer-before-hiring-them","status":"publish","type":"post","link":"https:\/\/islandwebsolutions.com\/10-questions-you-should-ask-a-web-designer-before-hiring-them\/","title":{"rendered":"10 Questions You Should Ask A Web Designer Before Hiring Them"},"content":{"rendered":"<p>&nbsp;<\/p>\n<h3>1. Can I meet you in person?<\/h3>\n<p>The number one question that you should ask a potential web designer before hiring them is &#8220;Can I meet you in person?&#8221; It&#8217;s a simple question but we are strong believers in vibes. We can judge someone&#8217;s authenticity and integrity by sitting at the same table and just having a general conversation. Sometimes, a designer and a client just don&#8217;t mesh well together. So let&#8217;s meet up and see how it feels. On top of that, you want to ask if you can meet in person because you want to physically meet and shake the hand of the person that&#8217;s going to build your website.<\/p>\n<h3>2. Can I see your portfolio?<\/h3>\n<p>Ask your web designer if you can go through their portfolio together and no, you do not need to see something exactly what you&#8217;re looking to build. You want to find out their web design capabilities and if the websites look professional. Each project is unique. Some questions to ask are; What were you or your team specifically responsible for when building this website? How involved was the client in the design process? Are your clients thrilled with the end product?<\/p>\n<h3>3. Request to do a reference check.<\/h3>\n<p>&#8220;Do you mind providing a reference with these websites? We would like to contact them and see how their experience was working with you.&#8221; Now if they get all jittery that means that something is wrong. If they have work on their portfolio that they&#8217;re standing behind and claiming to be their own then they should gladly submit and surrender the contact email or phone number to the person that owns that website. If not, call someone else.<\/p>\n<h3>4. Do you understand my objective with this website?<\/h3>\n<p>Every website design is different so that should be a major part of the conversation. They should understand your actual business model and what you&#8217;re trying to achieve with an online website or e-commerce platform. Make sure they seem interested in learning your business as they will essentially become a digital branch of your physical business which will 100% represent you in every way.<\/p>\n<h3>5. Where will my website be built?<\/h3>\n<p>&#8220;Physically, where will it be built? Yes, we&#8217;re sitting at this location but is going to be built in house? Is it going to be built overseas? Or is it going to be built in your home office?&#8221;  Most clients don&#8217;t care where the website is built as long as the communication is completely open. Here at Island Web, absolutely everything is done in-house by us. For an extra fee, clients can even meet with us and watch minor edits being made.  That does not mean that there are not talented people overseas it&#8217;s just that you want to know if they are being upfront with you. You want to know exactly what you&#8217;re paying for.<\/p>\n<h3>6. Can I make updates to my own website?<\/h3>\n<p>&#8220;As the website owner, do I have the opportunity to do simple updates?&#8221; Every day we experience this. Other web developers sort of lock people into this never-ending cycle of difficulty. The website is done and they do not want to release the keys to the house. Every time there&#8217;s an update you have to go through the developer. Sometimes they don&#8217;t respond for weeks and you lose the motivation to even make the updates. You want to know who&#8217;s going to be responsible for updates and can you personally do those updates on your own. At Island Web, we will give you the logins to your website, however, we will have to walk you through the process of how to make these updates because we don&#8217;t want anything to break. For a small added cost, we can make a reference video for your team that will show you step by step how to make simple updates. Updates can also always be handled by Island Web. We get most of our updates done within 24-48 hours.<\/p>\n<h3>7. When this website is complete who will own the website?<\/h3>\n<p>Believe it or not, there are web developers out there that will register your domain for you under their company name. It appears that you&#8217;re the owner of the website until you want to move to another development company and then you realize that the domain is not under your personal or business name. This happens absolutely every single day of the week for us. It is a hundred percent morally wrong. At Island Web, you will always 100% own your domain name and website design.<\/p>\n<h3>8. What do you know about SEO (Search Engine Optimization)?<\/h3>\n<p>Number 8 requires you to do a little bit of research first because you have to have a basic understanding of SEO. You want to ask the developer what does the developer or the designer personally knows about SEO. Designing a website has a lot to do with SEO. There are certain standards that Google allows us as developers to know. If they are not capable or do not have the understanding or education on SEO you&#8217;re putting your trust in the wrong people. If you ask them what they know about SEO and they go on and they seem educated, now you want to ask them for proof. Can you show me what your current ranking is on Google for certain keywords? You always want to look at this in your browser in incognito mode. If I&#8217;m looking on their computer, they&#8217;re always going to look like they ranked better than they do due to browser history. I want to see actual factual stats.<\/p>\n<h3>9.Have you ever built a successful website?<\/h3>\n<p>How are they going to build me a successful website if they have not built one themselves? Show me one website that you built that&#8217;s been successful. The definition of success can mean many different things. For an e-commerce website successful means, they&#8217;re making a profit. Yes, we understand as web developers that we&#8217;re not responsible for the profit. Maybe it&#8217;s a horrible product and horrible customer service. If I hire a boxing instructor because I want to become a professional boxer then the first question I&#8217;m going to ask the coach is, &#8220;what fights have your guys won? When is the last time you participated in a major event? If you never ever won a belt, how do I think you&#8217;re going to win one for me?&#8221; How can you request for a company to build a successful website for you that&#8217;s going to make a profit if they have never built a successful website in the past?<\/p>\n<h3>10. Will, you be around when we need you?<\/h3>\n<p>&#8220;Can I call upon you for help?&#8221; Your website gets launched and three months down the road something happens and it crashes.   Once this project is done is the company washing their hands-free of you or can you still approach them with simple questions and requests? What happens when the website is done and you need help? At Island Web, we bundle our hosting and maintenance costs to provide our clients with continued support once the website is built and live on the internet. Our prices are affordable and are determined according to how often each one of our clients will be needing our services.<\/p>\n<p><a href=\"https:\/\/islandwebsolutions.com\">Island Web Solutions<\/a> believes that business owners need to know the real questions to ask to find reliable and integrity based web developers. You want somebody you can count on. Contact our <a href=\"https:\/\/islandwebsolutions.com\">Long Island Web Design<\/a> specialists today!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The number one question that you should ask a potential web designer before hiring them is “Can I meet you in person?” It’s a simple question but we are strong believers in vibes. We can judge someone’s authenticity and integrity by sitting at the same table and just having a general conversation.<\/p>\n","protected":false},"author":1,"featured_media":2342,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[3],"tags":[],"_links":{"self":[{"href":"https:\/\/islandwebsolutions.com\/wp-json\/wp\/v2\/posts\/2273"}],"collection":[{"href":"https:\/\/islandwebsolutions.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/islandwebsolutions.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/islandwebsolutions.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/islandwebsolutions.com\/wp-json\/wp\/v2\/comments?post=2273"}],"version-history":[{"count":1,"href":"https:\/\/islandwebsolutions.com\/wp-json\/wp\/v2\/posts\/2273\/revisions"}],"predecessor-version":[{"id":2454,"href":"https:\/\/islandwebsolutions.com\/wp-json\/wp\/v2\/posts\/2273\/revisions\/2454"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/islandwebsolutions.com\/wp-json\/wp\/v2\/media\/2342"}],"wp:attachment":[{"href":"https:\/\/islandwebsolutions.com\/wp-json\/wp\/v2\/media?parent=2273"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/islandwebsolutions.com\/wp-json\/wp\/v2\/categories?post=2273"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/islandwebsolutions.com\/wp-json\/wp\/v2\/tags?post=2273"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}